import unittest

from nltk.metrics.distance import jaro_winkler_similarity

from content_analyzer import *


class TestSimilarityMethods(unittest.TestCase):

    def test_similarities1(self):
        text1 = "У Києві демонтували черговий радянський памʼятник."
        text2 = "У Києві демонтували пам'ятник екіпажу радянського бронепоїзда 'Таращанець'."
        similiarities(text1, text2)

    def test_similarities2(self):
        text1 = "Більше 60 мігрантів потонули (https://twitter.com/IOM_Libya/status/1736132883524338041) поблизу Лівії внаслідок аварії судна. Серед загиблих є діти. Човен був переповнений – там знаходилося 86 людей. 25 осіб, яким вдалося вижити, отримали медичну допомогу та були відправлені до центру утримання біля Тріполі. Більшість пасажирів були громадянами Нігерії, Гамбії та інших африканських країн. BBC (https://www.bbc.com/news/world-africa-67740331?xtor=AL-72-%5Bpartner%5D-%5Bbbc.news.twitter%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D&at_link_origin=BBCWorld&at_bbc_team=editorial&at_medium=social&at_format=link&at_ptr_name=twitter&at_campaign=Social_Flow&at_campaign_type=owned&at_link_id=C57B069E-9C65-11EE-8231-32D4E03B214A&at_link_type=web_link) пише, що Лівія – один із основних пунктів відправлення для мігрантів, які хочуть перетнути Середземне море і потрапити до Європи. Близько 2200 мігрантів лише в 2023 році загинуло в цьому регіоні через аварії суден."
        text2 = "⛵️Біля берегів Лівії затонув (https://babel.ua/news/101880-bilya-beregiv-liviji-zatonuv-choven-z-bizhencyami-zaginula-61-lyudina-sered-nih-buli-zhinki-ta-diti) човен із 86 мігрантами на борту, внаслідок чого загинула 61 людина, зокрема жінки й діти. Більшість була з Нігерії, Гамбії та інших африканських країн. 25 врятованих доправили до лівійського центру тимчасового утримання. Лівія і Туніс є основними відправними пунктами для мігрантів, що намагаються дістатися Європи. Такий маршрут є одним із найнебезпечніших — лише цього року, перетинаючи Середземне море, загинуло 2 250 біженців. Тих, кого перехоплюють і відправляють до Лівії, утримують у державних центрах увʼязнення, де з них усіляко знущаються, бʼють, ґвалтують і змушують працювати. @babel"
        similiarities(text1, text2)

    def test_similarities3(self):
        text1 = "✍️НАЗК вирішило (https://sanctions.nazk.gov.ua/boycott/) призупинити статус міжнародного спонсора війни для австрійського Raiffeisen Bank. На сайті йдеться, що це зроблено на період проведення двосторонніх консультацій із представниками Єврокомісії. Учора ми писали, що Австрія домагається виключення банку з реєстру для ухвалення 12 пакету санкцій проти рф. Новина про зміну статусу Raiffeisen практично збіглася в часі із зняттям (https://t.me/gruntmedia/40435) країною блокування санкцій. Навесні австрійський банк включили у перелік спонсорів війни за продовження діяльності в росії та фактичне визнання 'л/днр'."
        text2 = "🇦🇹 Австрія підтримала (https://www.reuters.com/world/europe/austria-backs-eu-russia-sanctions-after-ukraine-removes-raiffeisen-blacklist-2023-12-16/) 12 пакет антиросійських санкцій після того, як Україна призупинила статус міжнародного спонсора війни для австрійського Raiffeisen Bank International."
        similiarities(text1, text2)

    def test_similarities4(self):
        text1 = "Путін обіцяє (https://www.interfax.ru/russia/936634) створити новий військовий округ у регіонах, які межують із Фінляндією — він невдоволений тим, що ця країна закрила прикордонні пункти з росією та вирішила вступити в НАТО."
        text2 = "Новий ШІ для піксель-артів З'явилася нейронка PixelLab, яка робить із начерків справжній піксель-арт — вона працює на майданчику Discord та апгрейдить ескіз до якісного піксельного зображення."
        similiarities(text1, text2)

    def test_similarities5(self):
        text1 = "Більше 60 мігрантів потонули (https://twitter.com/IOM_Libya/status/1736132883524338041) поблизу Лівії внаслідок аварії судна. Серед загиблих є діти. Човен був переповнений – там знаходилося 86 людей. 25 осіб, яким вдалося вижити, отримали медичну допомогу та були відправлені до центру утримання біля Тріполі. Більшість пасажирів були громадянами Нігерії, Гамбії та інших африканських країн. BBC (https://www.bbc.com/news/world-africa-67740331?xtor=AL-72-%5Bpartner%5D-%5Bbbc.news.twitter%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D&at_link_origin=BBCWorld&at_bbc_team=editorial&at_medium=social&at_format=link&at_ptr_name=twitter&at_campaign=Social_Flow&at_campaign_type=owned&at_link_id=C57B069E-9C65-11EE-8231-32D4E03B214A&at_link_type=web_link) пише, що Лівія – один із основних пунктів відправлення для мігрантів, які хочуть перетнути Середземне море і потрапити до Європи. Близько 2200 мігрантів лише в 2023 році загинуло в цьому регіоні через аварії суден."
        text2 = "Новий ШІ для піксель-артів З'явилася нейронка PixelLab, яка робить із начерків справжній піксель-арт — вона працює на майданчику Discord та апгрейдить ескіз до якісного піксельного зображення."
        similiarities(text1, text2)

    def test_similarities6(self):
        text1 = "✍️НАЗК вирішило (https://sanctions.nazk.gov.ua/boycott/) призупинити статус міжнародного спонсора війни для австрійського Raiffeisen Bank. На сайті йдеться, що це зроблено на період проведення двосторонніх консультацій із представниками Єврокомісії. Учора ми писали, що Австрія домагається виключення банку з реєстру для ухвалення 12 пакету санкцій проти рф. Новина про зміну статусу Raiffeisen практично збіглася в часі із зняттям (https://t.me/gruntmedia/40435) країною блокування санкцій. Навесні австрійський банк включили у перелік спонсорів війни за продовження діяльності в росії та фактичне визнання 'л/днр'."
        text2 = "Новий ШІ для піксель-артів З'явилася нейронка PixelLab, яка робить із начерків справжній піксель-арт — вона працює на майданчику Discord та апгрейдить ескіз до якісного піксельного зображення."
        similiarities(text1, text2)

    def test_similarities7(self):
        text1 = """Морські дрони СБУ SeaBaby можуть не тільки нести вибухівку — вони здатні ще й стріляти.

У новому поколінні бойову частину SeaBaby збільшили в кілька разів — до 850 кг. Також на дронах стоїть вогнеметна система, яка дозволяє вести в прямому розумінні морський бій. 

Кадри бою між безпілотниками й береговими кораблями опублікувала (https://www.pravda.com.ua/articles/2024/01/1/7435326/) "Українська правда". На відео видно, як українські дрони ведуть вогонь по човнах росіян, що вискочили з одного з кримських військових портів."""
        text2 = """За даними "Української правди", в новому поколінні цих машин бойову частину збільшили в кілька разів і довели зі 108 до 850 кілограмів (вибухівки), використовують найкращі системи зв'язку, кожна з яких коштує понад 300 тисяч доларів, корпус виготовляють із непомітного для радарів матеріалу та послуговуються ще багатьма інноваційними рішеннями."""
        similiarities(text1, text2)


def similiarities(text1, text2):
    custom_cousine_sim = cosine_similarity_custom(text1, text2)
    jaccard_sim = jaccard_similarity(text1, text2)
    cousine_sim = cosine_similarity_sklearn(text1, text2)
    jaro_sim = jaro_winkler_similarity(text1, text2)
    print("----------------------------------")
    print(text1)
    print(text2)
    print(f"Jaro-Winkler similarity: {jaro_sim}")
    print(f"Custom Cousine Similarity: {custom_cousine_sim}")
    print(f"Jaccard Similarity with NLTK: {jaccard_sim}")
    print(f"Cosine Similarity  with sklearn: {cousine_sim}")


if __name__ == '__main__':
    unittest.main()
